## [foo/dolor/prod](https://omicron7.app.spacelift.io/stack/foo-dolor-prod/run/01HRYPJXE8BDJECE4CB5F7VN4C) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HRWZ8EC2HFM64J4BH82NH715] Planning changes with 0 custom hooks...
data.spacelift_stack.ansible: Reading...
tls_private_key.private_key: Refreshing state... [id=d1e44b0ae48586fdfdeab943b54e149ec112746a]
data.spacelift_stack.ansible: Read complete after 0s [id=spacelift-ansible]
spacelift_mounted_file.private_key: Refreshing state... [id=stack/spacelift-ansible/id_rsa]
data.aws_vpc.main: Reading...
aws_key_pair.ssh_key: Refreshing state... [id=spacelift-test-prod]
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-080e1f13689e07408]
data.aws_vpc.main: Read complete after 0s [id=vpc-dc2d9fb9]
data.aws_security_group.egress_any_public: Reading...
data.aws_security_group.ingress_ssh_public: Reading...
data.aws_subnet.prod_public_1a: Reading...
data.aws_subnet.prod_public_1a: Read complete after 0s [id=subnet-f5c2dfdd]
data.aws_security_group.ingress_ssh_public: Read complete after 0s [id=sg-096a4f902ad7e1d92]
data.aws_security_group.egress_any_public: Read complete after 0s [id=sg-0c9ef2a8aa4869890]
aws_instance.instances[0]: Refreshing state... [id=i-0a250d4a1495071b9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.instances[0] must be replaced
-/+ resource "aws_instance" "instances" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:056154071827:instance/i-0a250d4a1495071b9" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0a250d4a1495071b9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-045e054ed180ea10e" -> (known after apply)
      ~ private_dns                          = "ip-10-16-2-6.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.16.2.6" -> (known after apply)
      ~ public_dns                           = "ec2-18-208-161-68.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.208.161.68" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-f2c2dfda" -> "subnet-f5c2dfdd" # forces replacement
        tags                                 = {
            "Name" = "spacelift-test-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "Name"       = "spacelift-test"
              - "managed_by" = "terraform"
              - "owner"      = "devops-engineering-team@cru.org"
              - "terraform"  = "/mnt/workspace/source/foo/dolor/prod"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-021d0b39d4436de19" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ aws_instances = [
      - "18.208.161.68",
      + (known after apply),
    ]
[01HRWZ8EC2HFM64J4BH82NH715] Changes are GO
[01HRWZ8EC2HFM64J4BH82NH715] Uploading the list of managed resources...
[01HRWZ8EC2HFM64J4BH82NH715] Please be aware that the run changes calculation includes output changes.
[01HRWZ8EC2HFM64J4BH82NH715] Resource list upload is GO
[01HRWZ8EC2HFM64J4BH82NH715] Generating JSON representation of the plan...
[01HRWZ8EC2HFM64J4BH82NH715] JSON representation is GO
[01HRWZ8EC2HFM64J4BH82NH715] Loading custom plan policy inputs...
[01HRWZ8EC2HFM64J4BH82NH715] 0 custom plan policy inputs found
[01HRWZ8EC2HFM64J4BH82NH715] No plan policies to evaluate
```

</details>